08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "60";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4480
(
(-1.0422e-05 0 8.45135e-06)
(-9.32132e-06 0 -9.58906e-06)
(2.37516e-05 0 -4.11065e-05)
(0.000110697 0 -8.53203e-05)
(0.000268623 0 -0.000141526)
(0.00051339 0 -0.000208169)
(0.00085837 0 -0.000282999)
(0.00131334 0 -0.000363101)
...
)
;

boundaryField
{
    walls
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.1);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 4((0.0424027 0 -0.0805048) (0.0195254 0 -0.101317) (-0.00961897 0 -0.103781) (-0.0347224 0 -0.0843878));
    }
}


// ************************************************************************* //
