08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/0/UMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "60";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4480
(
(-9.67208e-06 0 7.79685e-06)
(-8.55512e-06 0 -9.18088e-06)
(2.27484e-05 0 -3.89579e-05)
(0.000105023 0 -8.08382e-05)
(0.000254604 0 -0.000134159)
(0.000486654 0 -0.000197445)
(0.000813957 0 -0.000268554)
(0.00124586 0 -0.000344697)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
136
(
(0.00205623 0 0)
(0.00408043 0 0)
(0.00749559 0 0)
(0.0110348 0 0)
(0.0145662 0 0)
(0.0180774 0 0)
(0.021503 0 0)
(0.0236562 0 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 -0.1);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 4((0.0425929 0 -0.0804351) (0.0197355 0 -0.101268) (-0.00939903 0 -0.103821) (-0.0345752 0 -0.0844557));
    }
}


// ************************************************************************* //
