08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "60";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    walls
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }
    top
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;
        phi             phi;
        k               k;
        value           uniform 10;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
