08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "60";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.00126562;

boundaryField
{
    walls
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
64
(
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
...
)
;
    }
    top
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
136
(
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
...
)
;
    }
    bottom
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
136
(
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
0.000160809
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.00126562;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.00126562;
    }
}


// ************************************************************************* //
