08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "60";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
8788
(
-2.50317e-08
2.50316e-08
1.59647e-08
-4.09963e-08
1.66894e-07
-1.5093e-07
4.72646e-07
-3.05752e-07
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 4(-0.00025 -0.00025 -0.00025 -0.00025);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 4(0.000221703 0.000268792 0.000275845 0.00023366);
    }
}


// ************************************************************************* //
