08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc scalarTransport(T, diffusivity=constant, D = 1e-9)

surfaceFieldValue1
{
        // Mandatory entries (unmodifiable)
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        // Mandatory entries (runtime modifiable)
        fields          (T);
        operation       areaAverage;
        regionType      patch;
        name            outlet;

        // Optional entries (runtime modifiable)
        postOperation   none;
        weightField     phi;
        scaleFactor     1.0;
        writeArea       false;
        surfaceFormat   none;

        // Optional (inherited) entries
        writeFields     false;
        scalingFactor   1.0;
        writePrecision  8;
        writeToFile     true;
        //writeControl    writeTime;
        writeControl    timeStep;
        writeInterval   10;
}

/*
mixingQualityCheck
{
    type coded;

    // Load the library containing the 'coded' functionObject
    libs            ("libutilityFunctionObjects.so");

    codeInclude
    #{
        #include "volFields.H"
    #};

    codeExecute
    #{
        const volScalarField& T
        (
            mesh().lookupObject<volScalarField>("T")
        );

        const scalar maxT = max(T).value();
        const scalar meanT = T.weightedAverage(mesh().V()).value();

        const scalar mixingQuality = meanT/maxT;
        Info << "mixingQuality = " << mixingQuality << endl;

        if (mixingQuality > 0.9)
        {
            const_cast<Time&>(mesh().time()).writeAndEnd();
        }
    #};
}
*/
// ************************************************************************* //
