08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishScalar2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
    {
        // Mandatory (inherited) entries
        name        inlet;
        type        faceSet;
        action      new;

        // Mandatory entries
        source      boxToFace;

        // Conditional mandatory entries
        box (0.25 0.0 0.799) (0.35 0.1 0.801);  // 20 cm from edge
        
    }
    {
        // Mandatory (inherited) entries
        name        outlet;
        type        faceSet;
        action      new;

        // Mandatory entries
        source      boxToFace;

        // Conditional mandatory entries
        box (3.15 0.0 -0.001) (3.25 0.1 0.001);  // 30 cm from edge
        
    }
);


// ************************************************************************* //